# MoveNext Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModuleIterator..::..MoveNext Method
MacroModuleIterator Class See Also
---
Increments the iterator to the next item.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public virtual bool MoveNext()
```

Visual Basic
---
```text
Public Overridable Function MoveNext As Boolean
```

Visual C++
---
```text
public:
virtual bool MoveNext()
```

# ### Return Value
True if there is a next available item in this iterator. False if the iterator has completed all available items.
# See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace